#+TITLE: Sahil's Emacs Configuration
#+AUTHOR: Sahil Gautam

** Keybindings

#+begin_src emacs-lisp
  (use-package evil-leader
    :ensure t
    :config
    (global-evil-leader-mode)
    (evil-leader/set-leader "<SPC>")
    (evil-leader/set-key
      "w" 'save-buffer
      "W" 'evil-write-all
      "mp" 'dashboard-open
      "mm" 'bookmark-set
      "." 'find-file
      "q" 'evil-quit
      "t" 'new-vterm-tile
      "ot" 'org-roam-buffer-toggle
      "of" 'org-roam-node-find
      "oi" 'org-roam-node-insert
      "r" 'org-babel-remove-result-one-or-many
      "x" 'org-babel-execute-src-block
      "sh" 'evil-window-split
      "sv" 'evil-window-vsplit
      "e" 'treemacs
      "1" (lambda () (interactive) (jump-to-nth-bookmark 1))
      "2" (lambda () (interactive) (jump-to-nth-bookmark 2))
      "3" (lambda () (interactive) (jump-to-nth-bookmark 3))
      "4" (lambda () (interactive) (jump-to-nth-bookmark 4))
      "5" (lambda () (interactive) (jump-to-nth-bookmark 5)))
    )

					  ; Window Navigation Keybindings Ctrl+VI
  (global-set-key (kbd "C-h") 'evil-window-left)
					  ; Not Working for some reason
					  ; (global-set-key (kbd "C-k") 'windmove-down)
  (global-set-key (kbd "C-k") 'windmove-up)
  (global-set-key (kbd "C-l") 'evil-window-right)

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (add-hook 'org-mode-hook (lambda ()
			     (evil-define-key 'normal org-mode-map (kbd "TAB") 'org-cycle)))
					  ; (define-key evil-insert-state-map (kbd "TAB") 'indent-for-tab-command)



  (global-set-key (kbd "C-o") 'previous-buffer)
  (global-set-key (kbd "C-i") 'next-buffer)

					  ; If pressed <TAB> in evil-insert mode, then it's a tabspace.
  (setq-default tab-width 2)
  (add-hook 'evil-insert-state-entry-hook
  (lambda ()
    (define-key evil-insert-state-map (kbd "TAB") 'tab-to-tab-stop)))

  (add-hook 'evil-normal-state-entry-hook
  (lambda ()
    (define-key evil-insert-state-map (kbd "TAB") 'tab-to-tab-stop)))
#+end_src

#+RESULTS:
| lambda | nil | (define-key evil-insert-state-map (kbd TAB) 'tab-to-tab-stop) |

#
** Hide Sourceblock Markers

#+begin_src emacs-lisp
  ;; Org mode
  (add-hook 'org-mode-hook
	    '(lambda ()

	       ;; Unset any previous customization for the background color
	       (set-face-attribute 'org-block-begin-line nil :background 'unspecified)
	       (set-face-attribute 'org-block-end-line nil :background 'unspecified)

	       ;; Set the foreground color to the value of the background color
	       (set-face-attribute 'org-block-begin-line nil
				   :foreground (face-background 'org-block-begin-line nil 'default))
	       (set-face-attribute 'org-block-end-line nil
				   :foreground (face-background 'org-block-end-line nil 'default))
	       ))
#+end_src

#+RESULTS:
| (lambda nil (set-face-attribute 'org-block-begin-line nil :background 'unspecified) (set-face-attribute 'org-block-end-line nil :background 'unspecified) (set-face-attribute 'org-block-begin-line nil :foreground (face-background 'org-block-begin-line nil 'default)) (set-face-attribute 'org-block-end-line nil :foreground (face-background 'org-block-end-line nil 'default))) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

